[


  {
    "id": "t001",
    "tipo": "Bootcamp",
    "nombre": "Fullstack JavaScript Development",
    "entidad": "Desafío Latam, Chile",
    "fecha": "(2024-Present)",
    "desc": "A one-year hands-on course covering Frontend Development with technologies such as HTML5, CSS3, JavaScript ES6, and React. Additionally, it includes Backend Development using NodeJS and database management with SQL."
  },
  {
    "id": "t002",
    "tipo": "Associate's Degree",
    "nombre": "Programming Analyst",
    "entidad": "CFT Cenco, Chile",
    "fecha": "(2024-2025)",
    "desc": "A professional technical training program covering areas such as programming paradigms, databases, project management, and other key topics in the tech industry."
  },


  {
    "id":"t003",
    "tipo":"268 hours online program",
    "nombre":"FrontEnd Development with React",
    "entidad":"Desafío Latam, Chile",
    "fecha":"(2025)",
    "desc":"A hands-on course on front-end development using html, css, javascript, and React, including topics like responsive design, form validation, DOM manipulation, API integration, and best practices for React components, state management, and routing."

  },

  {
    "id":"t004",
    "tipo":"40 hour online synchronous and asynchronous course",
    "nombre":"SQL",
    "entidad":"Desafío Latam, Chile",
    "fecha":"(2025)",
    "desc":"A practical course on PostgreSQL, a popular open-source relational database management system, applied to web development. It covers topics such as creating tables, inserting and querying data, and optimizing database performance."

  },

  {
    "id": "t004",
    "tipo": "Diploma",
    "nombre": "UX/UI Applied to Web Development",
    "entidad": "SENCE and Fundación Telefónica, Chile",
    "fecha": "(2024)",
    "desc": "A mostly asynchronous diploma program covering user experience principles, user interface development using frontend technologies, and cybersecurity fundamentals."
  },
  {
    "id": "t005",
    "tipo": "Live Course",
    "nombre": "Adopting the Agile Mindset: Agile Context",
    "entidad": "Academia Ágil, Mexico",
    "fecha": "(2024)",
    "desc": "An introductory course on agile methodologies for project management in the tech industry."
  },
  {
    "id": "t006",
    "tipo": "Asynchronous Course",
    "nombre": "Advanced CSS",
    "entidad": "Desafío Latam, Chile",
    "fecha": "(2024)",
    "desc": "An asynchronous deep-dive course on CSS, including properties like Flexbox, CSS Grid, and Media Queries to develop responsive designs."
  },
  {
    "id": "t007",
    "tipo": "Asynchronous Course",
    "nombre": "Introduction to Web Development",
    "entidad": "Desafío Latam, Chile",
    "fecha": "(2023)",
    "desc": "An introductory course on web development for static web pages, covering technologies such as HTML5, CSS3, and version control with Git and GitHub."
  },
  {
    "id": "t008",
    "tipo": "Asynchronous Course",
    "nombre": "Computer Assembly and Repair",
    "entidad": "Comunidad Reparando, Argentina",
    "fecha": "(2023)",
    "desc": "A course covering hardware fundamentals, cleaning, maintenance, and replacement of components for desktop computers."
  }
]
